MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX230F064C.atdf
         <register caption="" name="a1" offset="0x14" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="a1" />
         </register>
         <register caption="" name="a2" offset="0x18" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="a2" />
         </register>
         <register caption="" name="a3" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="a3" />
         </register>
         <register caption="" name="t0" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t0" />
         </register>
         <register caption="" name="t1" offset="0x24" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t1" />
         </register>
         <register caption="" name="t2" offset="0x28" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t2" />
         </register>
         <register caption="" name="t3" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t3" />
         </register>
         <register caption="" name="t4" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t4" />
         </register>
         <register caption="" name="t5" offset="0x34" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t5" />
         </register>
         <register caption="" name="t6" offset="0x38" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t6" />
         </register>
         <register caption="" name="t7" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t7" />
         </register>
         <register caption="" name="s0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s0" />
         </register>
         <register caption="" name="s1" offset="0x44" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s1" />
         </register>
         <register caption="" name="s2" offset="0x48" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s2" />
         </register>
         <register caption="" name="s3" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s3" />
         </register>
         <register caption="" name="s4" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s4" />
         </register>
         <register caption="" name="s5" offset="0x54" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s5" />
         </register>
         <register caption="" name="s6" offset="0x58" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s6" />
         </register>
         <register caption="" name="s7" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="s7" />
         </register>
         <register caption="" name="t8" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t8" />
         </register>
         <register caption="" name="t9" offset="0x64" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="t9" />
         </register>
         <register caption="" name="k0" offset="0x68" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="k0" />
         </register>
         <register caption="" name="k1" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="k1" />
         </register>
         <register caption="" name="gp" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="gp" />
         </register>
         <register caption="" name="sp" offset="0x74" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="sp" />
         </register>
         <register caption="" name="fp" offset="0x78" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="fp" />
         </register>
         <register caption="" name="ra" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ra" />
         </register>
         <register caption="" name="HWREna" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="Mask" />
         </register>
         <register caption="" name="BadVAddr" offset="0x84" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="BadVAddr" />
         </register>
         <register caption="" name="Count" offset="0x88" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Count" />
         </register>
         <register caption="" name="Compare" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="Compare" />
         </register>
         <register caption="" name="Status" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="IE" />
            <bitfield mask="0x00000002" name="EXL" />
            <bitfield mask="0x00000004" name="ERL" />
            <bitfield mask="0x00000010" name="UM" />
            <bitfield mask="0x00000300" name="IM" />
            <bitfield mask="0x0000FC00" name="IPL" />
            <bitfield mask="0x00020000" name="CEE" />
            <bitfield mask="0x00080000" name="NMI" />
            <bitfield mask="0x00100000" name="SR" />
            <bitfield mask="0x00200000" name="TS" />
            <bitfield mask="0x00400000" name="BEV" />
            <bitfield mask="0x02000000" name="RE" />
            <bitfield mask="0x04000000" name="FR" />
            <bitfield mask="0x08000000" name="RP" />
            <bitfield mask="0xF0000000" name="CU" />
         </register>
         <register caption="" name="IntCtl" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x000003E0" name="VS" />
            <bitfield mask="0x1C000000" name="IPPCI" />
            <bitfield mask="0xE0000000" name="IPTI" />
         </register>
         <register caption="" name="SRSCtl" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CSS" />
            <bitfield mask="0x000003C0" name="PSS" />
            <bitfield mask="0x0000F000" name="ESS" />
            <bitfield mask="0x003C0000" name="EICSS" />
            <bitfield mask="0x3C000000" name="HSS" />
         </register>
         <register caption="" name="SRSMap" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SSV0" />
            <bitfield mask="0x000000F0" name="SSV1" />
            <bitfield mask="0x00000F00" name="SSV2" />
            <bitfield mask="0x0000F000" name="SSV3" />
            <bitfield mask="0x000F0000" name="SSV4" />
            <bitfield mask="0x00F00000" name="SSV5" />
            <bitfield mask="0x0F000000" name="SSV6" />
            <bitfield mask="0xF0000000" name="SSV7" />
         </register>
         <register caption="" name="Cause" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000007C" name="ExcCode" />
            <bitfield mask="0x00000300" name="IP" />
            <bitfield mask="0x0000FC00" name="RIPL" />
            <bitfield mask="0x00400000" name="WP" />
            <bitfield mask="0x00800000" name="IV" />
            <bitfield mask="0x04000000" name="PCI" />
            <bitfield mask="0x08000000" name="DC" />
            <bitfield mask="0x30000000" name="CE" />
            <bitfield mask="0x40000000" name="TI" />
            <bitfield mask="0x80000000" name="BD" />
         </register>
         <register caption="" name="EPC" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="EPC" />
         </register>
